# GetChildren Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisplacementElement..::..GetChildren Method
DisplacementElement Class See Also
---
Returns a set of DisplacementElements which have this DisplacementElement as a parent.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<DisplacementElement> GetChildren()
```

Visual Basic
---
```text
Public Function GetChildren As IList(Of DisplacementElement)
```

Visual C++
---
```text
public:
IList<DisplacementElement^>^ GetChildren()
```

# ### Return Value
The returned array is sorted by element id.
# See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace